//Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.


int n = Convert.ToInt32(Console.ReadLine());

for (int a = 1; a <= n; a++)

Console.WriteLine(a*a*a);
